vcr_cassettes/show_refund.yml

---
http_interactions:
- request:
    method: get
    uri: https://01010101010101010101010101010101:ABABABABABABABABABABABABABABABABABABABAB@test.moip.com.br/v2/refunds/REF-QW4T48M7NDFH
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 27 Feb 2015 21:02:04 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '688'
      Connection:
      - keep-alive
      Status:
      - 200 OK
      X-Newrelic-App-Data:
      - PxQFUlBXAQoTV1VaDgIEV0YdFGQHBDcQUQxLA1tMXV1dORYzVBJHNQFUZAQUFVFQVThOFAVtGBQBV0NdBhU/TUsLXB8YEHN3Z0wbTQFPA05VGANWV1oJAwRIUU4VUgJQUwQHUgNTUANUBFtQXBpp
      Vary:
      - Accept-Encoding
      X-Content-Type-Options:
      - nosniff
    body:
      encoding: UTF-8
      string: '{"id":"REF-QW4T48M7NDFH","status":"COMPLETED","events":[{"createdAt":"2015-02-27T17:56:22-0300","type":"REFUND.COMPLETED"},{"createdAt":"2015-02-27T17:56:21-0300","type":"REFUND.REQUESTED"}],"amount":{"fees":0,"currency":"BRL","total":100},"type":"PARTIAL","refundingInstrument":{"creditCard":{"brand":"VISA","first6":"401200","last4":"3335"},"method":"CREDIT_CARD"},"createdAt":"2015-02-27T17:56:21-0300","_links":{"payment":{"title":"PAY-5VWJOESX1BWB","href":"https://test.moip.com.br/v2/payments/PAY-5VWJOESX1BWB"},"order":{"title":"ORD-6K8XPJD9O2KH","href":"https://test.moip.com.br/v2/orders/ORD-6K8XPJD9O2KH"},"self":{"href":"https://test.moip.com.br/v2/refunds/REF-QW4T48M7NDFH"}}}'
    http_version: 
  recorded_at: Fri, 27 Feb 2015 21:02:03 GMT
recorded_with: VCR 2.9.3
